#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.vstshop.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.vstshop.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1ZF7UXXTOIYSW]
module.vstshop.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.vstshop.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3R14G7MJNXMR4]
module.vstshop.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vstshop.aws_cloudfront_distribution.s3_distribution will be destroyed
  # (because aws_cloudfront_distribution.s3_distribution is not in configuration)
  - resource "aws_cloudfront_distribution" "s3_distribution" {
      - aliases                         = [] -> null
      - arn                             = "arn:aws:cloudfront::195481994910:distribution/E1ZF7UXXTOIYSW" -> null
      - caller_reference                = "terraform-20260209204327896000000001" -> null
      - default_root_object             = "index.html" -> null
      - domain_name                     = "d31iybrxaouvoy.cloudfront.net" -> null
      - enabled                         = true -> null
      - etag                            = "E1F83G8C2ARO7P" -> null
      - hosted_zone_id                  = "Z2FDTNDATAQYW2" -> null
      - http_version                    = "http2" -> null
      - id                              = "E1ZF7UXXTOIYSW" -> null
      - in_progress_validation_batches  = 0 -> null
      - is_ipv6_enabled                 = true -> null
      - last_modified_time              = "2026-02-11 20:41:26.998 +0000 UTC" -> null
      - logging_v1_enabled              = false -> null
      - price_class                     = "PriceClass_All" -> null
      - retain_on_delete                = false -> null
      - staging                         = false -> null
      - status                          = "Deployed" -> null
      - tags                            = {} -> null
      - tags_all                        = {} -> null
      - trusted_key_groups              = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                 = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment             = true -> null
        # (3 unchanged attributes hidden)

      - default_cache_behavior {
          - allowed_methods            = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods             = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress                   = false -> null
          - default_ttl                = 3600 -> null
          - max_ttl                    = 86400 -> null
          - min_ttl                    = 0 -> null
          - smooth_streaming           = false -> null
          - target_origin_id           = "S3Origin" -> null
          - trusted_key_groups         = [] -> null
          - trusted_signers            = [] -> null
          - viewer_protocol_policy     = "redirect-to-https" -> null
            # (5 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - grpc_config {
              - enabled = false -> null
            }
        }

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "vstshop-frontend-dev123.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E3R14G7MJNXMR4" -> null
          - origin_id                   = "S3Origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - cloudfront_default_certificate = true -> null
          - minimum_protocol_version       = "TLSv1" -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.vstshop.aws_cloudfront_origin_access_control.default will be destroyed
  # (because aws_cloudfront_origin_access_control.default is not in configuration)
  - resource "aws_cloudfront_origin_access_control" "default" {
      - arn                               = "arn:aws:cloudfront::195481994910:origin-access-control/E3R14G7MJNXMR4" -> null
      - description                       = "Managed by Terraform" -> null
      - etag                              = "E1F83G8C2ARO7P" -> null
      - id                                = "E3R14G7MJNXMR4" -> null
      - name                              = "vstshop-oac-dev" -> null
      - origin_access_control_origin_type = "s3" -> null
      - signing_behavior                  = "always" -> null
      - signing_protocol                  = "sigv4" -> null
    }

  # module.vstshop.aws_s3_bucket.frontend will be destroyed
  # (because aws_s3_bucket.frontend is not in configuration)
  - resource "aws_s3_bucket" "frontend" {
      - arn                         = "arn:aws:s3:::vstshop-frontend-dev123" -> null
      - bucket                      = "vstshop-frontend-dev123" -> null
      - bucket_domain_name          = "vstshop-frontend-dev123.s3.amazonaws.com" -> null
      - bucket_region               = "us-east-2" -> null
      - bucket_regional_domain_name = "vstshop-frontend-dev123.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "vstshop-frontend-dev123" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::195481994910:distribution/E1ZF7UXXTOIYSW"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::vstshop-frontend-dev123/*"
                      - Sid       = "AllowCloudFrontRead"
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::195481994910:root",
                              - "arn:aws:iam::086739225244:role/github-actions-oidc-role",
                            ]
                        }
                      - Resource  = [
                          - "arn:aws:s3:::vstshop-frontend-dev123",
                          - "arn:aws:s3:::vstshop-frontend-dev123/*",
                        ]
                      - Sid       = "AllowGithubActionsAndLocalAdmin"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "24a790ab6cf3a8b35f27a8c1dc4f22b3e5b07276b7bffc1b803cf07b7ff7fc6a" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.vstshop.aws_s3_bucket_policy.frontend_policy will be destroyed
  # (because aws_s3_bucket_policy.frontend_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "frontend_policy" {
      - bucket = "vstshop-frontend-dev123" -> null
      - id     = "vstshop-frontend-dev123" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::195481994910:distribution/E1ZF7UXXTOIYSW"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::vstshop-frontend-dev123/*"
                      - Sid       = "AllowCloudFrontRead"
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::086739225244:role/github-actions-oidc-role",
                              - "arn:aws:iam::195481994910:root",
                            ]
                        }
                      - Resource  = [
                          - "arn:aws:s3:::vstshop-frontend-dev123",
                          - "arn:aws:s3:::vstshop-frontend-dev123/*",
                        ]
                      - Sid       = "AllowGithubActionsAndLocalAdmin"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region = "us-east-2" -> null
    }

  # module.vstshop.aws_s3_bucket_public_access_block.frontend will be destroyed
  # (because aws_s3_bucket_public_access_block.frontend is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "frontend" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "vstshop-frontend-dev123" -> null
      - id                      = "vstshop-frontend-dev123" -> null
      - ignore_public_acls      = true -> null
      - region                  = "us-east-2" -> null
      - restrict_public_buckets = true -> null
    }

  # module.vstshop_auth.aws_cognito_user_pool.pool will be created
  + resource "aws_cognito_user_pool" "pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "vstshop-user-pool-dev"
      + region                     = "us-east-2"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_symbols                  = true
          + temporary_password_validity_days = (known after apply)
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.vstshop_auth.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
          + "implicit",
        ]
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + (known after apply),
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = (known after apply)
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "vstshop-client-dev"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + region                                        = "us-east-2"
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.vstshop_auth.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "vstshop-dev-vst-dev-123"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + region                          = "us-east-2"
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.vstshop_frontend.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "S3Origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.vstshop_frontend.aws_cloudfront_origin_access_control.default will be created
  + resource "aws_cloudfront_origin_access_control" "default" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "vstshop-oac-dev"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.vstshop_frontend.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "vstshop-frontend-dev123"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.vstshop_frontend.aws_s3_bucket_policy.frontend_policy will be created
  + resource "aws_s3_bucket_policy" "frontend_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # module.vstshop_frontend.aws_s3_bucket_public_access_block.frontend will be created
  + resource "aws_s3_bucket_public_access_block" "frontend" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

Plan: 8 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ distribution_id = "E1ZF7UXXTOIYSW" -> (known after apply)
  ~ s3_bucket_name  = "vstshop-frontend-dev123" -> (known after apply)
  ~ website_url     = "https://d31iybrxaouvoy.cloudfront.net" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>